vwitti/stm32n6_demo_psram/submodules/STM32CubeN6_V1.3.0/Projects/NUCLEO-N657X0-Q/Examples/LPUART/LPUART_WakeUpFromStop/FSBL/Src/main.c
  return 0;
}
#endif /* !defined(BOARD_IN_STOP_MODE) */
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while (1)
  {
    /* In case of error, LED1 transmits a sequence of three dots, three dashes, three dots */
    BSP_LED_On(LED1);
    HAL_Delay(300);
    BSP_LED_Off(LED1);
    HAL_Delay(300);
    BSP_LED_On(LED1);
    HAL_Delay(300);
    BSP_LED_Off(LED1);
    HAL_Delay(300);
    BSP_LED_On(LED1);
    HAL_Delay(300);
    BSP_LED_Off(LED1);
    HAL_Delay(300);
    BSP_LED_On(LED1);
    HAL_Delay(700);
    BSP_LED_Off(LED1);
    HAL_Delay(700);
    BSP_LED_On(LED1);
    HAL_Delay(700);
    BSP_LED_Off(LED1);
    HAL_Delay(700);
    BSP_LED_On(LED1);
    HAL_Delay(700);
    BSP_LED_Off(LED1);
    HAL_Delay(700);
    BSP_LED_On(LED1);
    HAL_Delay(300);
    BSP_LED_Off(LED1);
    HAL_Delay(300);
    BSP_LED_On(LED1);
    HAL_Delay(300);
    BSP_LED_Off(LED1);
    HAL_Delay(300);
    BSP_LED_On(LED1);
    HAL_Delay(300);
    BSP_LED_Off(LED1);
    HAL_Delay(800);
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
